<template>
<div>
    <MyDialog :isShow="isShow">
        <div class="dialog">
            <h1>添加图表</h1>
            <h1>选择工作表</h1>
            <p>
                工作表名称：<span>{{table_name}}</span>
            </p>
            <tree ref='tree' :treeData="tableOption" :options="options" @node-click='handleNode' />
            <button @click="showDialog">确定</button>
        </div>
    </MyDialog>
    <div class="map" v-show="!isShow">
        <div class="map-left">
            <div class="map-left-table">
                <h1> 工作表 </h1>
                <p> {{table_name}}</p>
                <hr>
            </div>
            <div class="map-left-layer">
                <h1> 图层 </h1>
                <p>{{table_name}}</p>
                <hr>
            </div>
            <div class="map-left-field" @drop='drop($event)' @dragover='allowDrop($event)'>
                <h1> 字段 </h1>

                <div class='select-item' draggable='true' @dragstart='drag($event)' v-for="field in fields"><icon name="bookmark"></icon>{{field}}</div>
            </div>
        </div>
   
    <div class="map-content">
        <div class="map-content-condition">
            <div >
                <div class="drag-name">维度</div>
                <div class="drag-div" @drop='drop1($event)' @dragover='allowDrop($event)'>
                </div>
            </div>
            
            <hr>
            <div >
                <div class="drag-name">数值</div>
                <div class="drag-div2" @drop='drop2($event)' @dragover='allowDrop($event)' >
                </div>
            </div>
            
            <hr>

        </div>
        <div class="map-content-down">
            <div class="map-content-sort">
                <div>
                    <h1>筛选器</h1>
                </div>
                <br>
                <br>
                <br>
                <br>
                <br>
                <br>
                <br>
                <br>
                <br>
                <br>
                <br>
                <br>
                <br>
                <br>
                <hr>

                
                <div>
                    <h1>颜色样式</h1>
                </div>
            </div>
            <div id="map"> </div>
        </div>
    </div>
    <div class="map-right">
        <div class="map-title">
            <h1>图表标题</h1>
            <input v-model='title' placeholder="图表标题">
            <hr> </div>
        <div class="map-type">
            <h1>图表类型</h1>
            <router-link to='/map/map1' tag='div' @click.native="map1Click" v-bind:class="{'map-type-selected':selected1}" class="div1"><img src="../assets/mapType/1.png" height="33" width="33" title="气泡图"></router-link>
            <router-link v-bind:class="{'map-type-selected':selected2}" class="div2" to='/map/map2' tag='div' @click.native="map2Click"><img src="../assets/mapType/2.png" height="33" width="33" title="热力图"></router-link>
            <router-link v-bind:class="{'map-type-selected':selected3}" class="div3" to='/map/map3' tag='div' @click.native="map3Click"><img src="../assets/mapType/3.png" height="33" width="33" title="海量点"></router-link>
            <router-link v-bind:class="{'map-type-selected':selected4}" class="div4" to='/map/map4' tag='div'><img src="../assets/mapType/4.png" height="33" width="33" title="统计图"></router-link>
            <router-link v-bind:class="{'map-type-selected':selected5}" class="div5" to='/map/map5' tag='div'><img src="../assets/mapType/5.png" height="33" width="33" title="轨迹图"></router-link>
            <router-link v-bind:class="{'map-type-selected':selected6}" class="div6" to='/map/map6' tag='div'><img src="../assets/mapType/6.png" height="33" width="33" title="动态轨迹图"></router-link>
        </div>
        <div class="map-option">
            <hr>
            <h1>图表选项</h1>
            <router-view @icon-change="map1Click" @rad-change="map2Click"></router-view>
        </div>
    </div>
</div>
</div>

</template> 
<script>
import echarts from 'echarts'
import bmap from 'echarts/extension/bmap/bmap' 
import MyDialog from '../components/base/dialog.vue' 
import Tree from '../components/tree/tree.vue' 
let dom=null
export default {
   
    data() {
     
        return {
            // 地图名称
            title:'',
            //是否创建地图
            isShow:true, 
            //工作表名称
            table_name:'',
            //选择工作表数据
            tableOption:[
        {      
          id: 'folder2',
          label: '本地生活数据',
          open: true,
          checked: false,
          parentId: null,
          visible: true,
          searched: false,
          children: [
            {
              id: 'table1',
              label: '美食类商铺数据',
              checked: false,
              parentId: 5,
              searched: true,
              visible: true
            },
            {
              id:'table2',
              label: '北京校区信息数据',
              checked: false,
              parentId: 5,
              searched: true,
              visible: true
            },{
              id: 'table3',
              label: '居民收支数据',
              checked: false,
              parentId:5,
              searched: true,
              visible: true
            }
          ]
        }
      ], 
         //工作表选项
            options: {
                showCheckbox: false,
                search: {
                    useInitial: true, useEnglish: false, customFilter: null
                }
            } ,
            //工作表id
            table_id:'',
            //字段
            fields:[],
            //拖动元素名称
            drag_name:'',
            selected1:true,
            selected2:false,
            selected3:false,
            selected4:false,
            selected5:false,
            selected6:false, //散点图支持的图形符号形状
            map1_type:['circle',
            'pin',
            'rect',
            'triangle',
            'diamond'],
            data:[]
        }
    },
 mounted() {
    //获取工作表选项
        this.$http.get('api/table/list')
        .then((res) => {
            
        }, (error) => {
          console.log(error)
        });
    //获取工作表数据
        this.$http.get('api/table/data')
        .then((res) => {
            this.data=res.data.data;
        }, (error) => {
          console.log(error)
        });
    //根据获取的数据初始化地图
        this.init()
    }
    ,
    methods: {
        //关闭对话框
        showDialog() {
            this.isShow=!this.isShow
        },
        //选择工作表
        handleNode(node){
            this.table_name=node.label;
            this.table_id=node.id;
             //获取工作表字段
        this.$http.get('api/table/field')
        .then((res) => {
            this.fields=res.data.data
                console.log(this.fields)
        }, (error) => {
          console.log(error)
        });
        },
        //拖动
     drag:function(event){
       dom = event.currentTarget
       //设置拖动字段的名称
       this.drag_name=event.currentTarget.innerText
    },
    //拖动到维度
    drop1:function(event){
      event.preventDefault();
      event.target.appendChild(dom);
    },
    //拖动到数值
    drop2:function(event){
      event.preventDefault();
      event.target.appendChild(dom);
    },
    //拖动回去
     drop:function(event){
      event.preventDefault();
      event.target.appendChild(dom);
    },
    allowDrop:function(event){
      event.preventDefault();
    },
    init() {
            //进入页面空地图
            var map=new BMap.Map("map");
            // 创建地图实例
            var point=new BMap.Point(116.418261, 39.921984);
            map.centerAndZoom(point, 15); // 初始化地图，设置中心点坐标和地图级别
            map.enableScrollWheelZoom(); // 允许滚轮缩放
            map.addControl(new BMap.NavigationControl());
            map.addControl(new BMap.ScaleControl());
    }
        ,
    //选择气泡图
    map1Click(type) {
            this.selected1=true;
            this.selected2=false;
            this.selected3=false;
            this.selected4=false;
            this.selected5=false;
            this.selected6=false;
            //echarts实例
            var myChart=echarts.init(document.getElementById('map'));
            //数据
            let points=[];
            this.data.forEach(function(val, index) {
                let arr=[val['经度'], val['纬度']] 
                points.push(arr)
            }
            ) // 选项
            var option= {
                //加载bmap组件
                bmap: {
                    // 百度地图中心经纬度
                    center: [116.418261,
                    39.921984], // 百度地图缩放
                    zoom: 14, // 是否开启拖拽缩放，可以只设置 'scale' 或者 'move'
                    roam: true, // 百度地图的自定义样式，见 http://developer.baidu.com/map/jsdevelop-11.htm
                    mapStyle: {}
                }
                ,
                title: {
                    text: this.title,
                    left: 'center',
                    top: 5,
                    backgroundColor: "rgba(255,255,255,0.8)",
                    textStyle: {
                        color: "#2B98DC", fontWeight: "bold"
                    }
                }
                ,
                series: [ {
                    type: 'scatter', // 使用百度地图坐标系
                    coordinateSystem: 'bmap', // 数据格式跟在 geo 坐标系上一样，每一项都是 [经度，纬度，数值大小，其它维度...]
                    data: points, 
                    symbol: this.map1_type[type]
                }
                ]
            }
            ;
            myChart.setOption(option);
            // 添加百度地图插件
            var bmap=myChart.getModel().getComponent('bmap').getBMap();
            bmap.addControl(new BMap.MapTypeControl());
            bmap.enableScrollWheelZoom(); // 允许滚轮缩放
            bmap.addControl(new BMap.NavigationControl());
            bmap.addControl(new BMap.ScaleControl());
        }
        ,
        map2Click(val,which) {
            if(val instanceof Object) {
                val=20
            }
            if(this.drag_name==undefined||this.drag_name==null)
            {
                return alert("请选择维度");
            }
            else{
                console.log(this.drag_name)
                            which=this.drag_name;
            this.selected1=false;
            this.selected2=true;
            this.selected3=false;
            this.selected4=false;
            this.selected5=false;
            this.selected6=false;
            //echarts实例
            var myChart=echarts.init(document.getElementById('map'));
            //数据
            let points=[];
            this.data.forEach(function(val, index) {
                let arr=[val['经度'], val['纬度'],val[which]] 
                 points.push(arr)
            }
            )

             myChart.setOption( {
                animation: false, bmap: {
                    center: [116.418261, 39.921984], zoom: 14, roam: true
                }
                , visualMap: {
                    show: false, top: 'top', min: 0, max: 5, seriesIndex: 0, calculable: true, inRange: {
                        color: ['blue', 'blue', 'green', 'yellow', 'red']
                    }
                }
                , series: [ {
                    type: 'heatmap', coordinateSystem: 'bmap', data: points, pointSize: val, blurSize: 6
                }
                ]
            }
            );
            // 添加百度地图插件
            var bmap=myChart.getModel().getComponent('bmap').getBMap();
            bmap.addControl(new BMap.MapTypeControl());
            bmap.enableScrollWheelZoom(); // 允许滚轮缩放
            bmap.addControl(new BMap.NavigationControl());
            bmap.addControl(new BMap.ScaleControl());
            }

        }
        ,
        map3Click() {
            this.selected1=false;
            this.selected2=false;
            this.selected3=true;
            this.selected4=false;
            this.selected5=false;
            this.selected6=false;
            // 基于准备好的dom，初始化echarts实例
            var myChart=echarts.init(document.getElementById('map'));
            var colorList=[ '#5AB1EF',
            '#2EC7C9',
            '#B6A2DE',
            "#FFB980",
            '#ED868C',
            "#FF0000",
            "#C23531"];
            var labels=["面议",
            "<5K",
            "5-8K",
            "8-10K",
            "10-15K",
            "15-20K",
            ">20K"];
            var points= {
                "8-10K": [[120.677751, 31.301185, 1], [120.5361, 31.278975, 1], [120.743523, 31.260158, 1], [120.736745, 31.269358, 1], [120.677751, 31.301185, 1], [120.736745, 31.269358, 1], [120.743858, 31.263709, 1], [120.740392, 31.270454, 1], [120.729188, 31.266647, 1], [120.74092, 31.260035, 1], [120.428033, 31.33165, 1], [120.743858, 31.263709, 1], [120.626152, 31.468818, 1], [120.745715, 31.270792, 1], [120.577214, 31.31277, 1], [120.621102, 31.239954, 1], [120.739801, 31.34386, 1], [120.577214, 31.31277, 1], [120.428033, 31.33165, 1], [120.428033, 31.33165, 1], [120.740392, 31.270454, 1], [120.745897, 31.280916, 1], [120.645129, 31.287979, 1], [120.673487, 31.30151, 1], [120.621279, 31.260658, 1], [120.620639, 31.348511, 1], [120.740392, 31.270454, 1], [120.645536, 31.285221, 1], [120.743996, 31.2632, 1], [120.742956, 31.272322, 1], [120.744378, 31.282791, 1], [120.626152, 31.468818, 1], [120.746911, 31.28105, 1], [120.675773, 31.301285, 1], [120.736745, 31.269358, 1], [120.428033, 31.33165, 1], [120.672869, 31.294762, 1], [120.736641, 31.366071, 1], [120.427795, 31.332868, 1], [120.740906, 31.259732, 1], [120.789811, 31.31306, 1], [120.713688, 31.329436, 1], [120.740392, 31.270454, 1], [120.42881, 31.342064, 1], [121.060292, 31.300047, 1], [120.743858, 31.263709, 1], [120.74092, 31.260035, 1], [120.41821, 31.368697, 1], [120.830034, 31.321659, 1], [120.589613, 31.304566, 1], [120.782438, 31.313247, 1], [120.545678, 31.283175, 1], [120.740392, 31.270454, 1], [120.729188, 31.266647, 1], [120.800638, 31.603136, 1], [120.673487, 31.30151, 1], [120.544973, 31.265899, 1], [120.428409, 31.331202, 1], [120.728959, 31.283179, 1], [116.446964, 40.047275, 1], [120.544973, 31.265899, 1], [120.740392, 31.270454, 1], [120.751868, 31.276324, 1], [120.428409, 31.331202, 1], [120.6771, 31.299978, 1], [120.745715, 31.270792, 1], [120.589613, 31.304566, 1], [120.544388, 31.281287, 1], [120.736641, 31.366071, 1], [120.897596, 31.021527, 1], [120.729188, 31.266647, 1], [120.782418, 31.313036, 1], [120.628268, 31.259262, 1], [120.675773, 31.301285, 1], [120.620621, 31.256209, 1], [120.740906, 31.259732, 1], [120.719815, 31.329722, 1], [120.740392, 31.270454, 1], [120.746368, 31.270891, 1], [120.736745, 31.269358, 1], [120.729188, 31.266647, 1], [120.67747, 31.299932, 1], [120.745715, 31.270792, 1], [121.110091, 31.458302, 1], [121.131831, 31.295321, 1], [120.67747, 31.299932, 1], [120.589613, 31.304566, 1], [120.627095, 31.239935, 1], [120.740392, 31.270454, 1], [120.587108, 31.296977, 1], [120.673487, 31.30151, 1], [120.540591, 31.182041, 1], [120.635477, 31.277872, 1]], "10-15K": [[120.614261, 31.259433, 1], [120.740392, 31.270454, 1], [120.740392, 31.270454, 1], [120.650182, 31.431908, 1], [116.446964, 40.047275, 1], [120.677907, 31.322893, 1], [120.737579, 31.268801, 1], [120.603479, 31.217784, 1], [120.782418, 31.313036, 1], [120.545678, 31.283175, 1], [120.849832, 31.32499, 1], [120.534879, 31.288799, 1], [120.737579, 31.268801, 1], [120.751868, 31.276324, 1], [121.40008, 31.230058, 1], [120.830034, 31.321659, 1], [120.706951, 31.437298, 1], [120.745472, 31.272965, 1], [120.736056, 31.264702, 1], [120.748793, 31.281395, 1], [120.626152, 31.468818, 1], [120.728959, 31.283179, 1], [120.745472, 31.272965, 1], [120.745472, 31.272965, 1], [120.745472, 31.272965, 1], [120.545678, 31.283175, 1], [120.425087, 31.340143, 1], [120.425087, 31.340143, 1], [120.621102, 31.239954, 1], [120.695298, 31.183873, 1], [120.54399, 31.274603, 1], [120.673487, 31.30151, 1], [121.131831, 31.295321, 1], [120.736745, 31.269358, 1], [120.742956, 31.272322, 1], [120.736056, 31.264702, 1], [120.726406, 31.328809, 1], [120.746911, 31.28105, 1], [120.746911, 31.28105, 1], [120.751868, 31.276324, 1], [120.729188, 31.266647, 1], [120.428033, 31.33165, 1], [120.626152, 31.468818, 1], [120.740906, 31.259732, 1], [120.742956, 31.272322, 1], [120.694857, 31.439988, 1], [120.677751, 31.301185, 1], [120.740392, 31.270454, 1], [120.427795, 31.332868, 1], [120.72069, 31.367386, 1], [120.740392, 31.270454, 1], [120.729188, 31.266647, 1], [120.736745, 31.269358, 1], [120.428409, 31.331202, 1], [120.740819, 31.259654, 1], [120.830034, 31.321659, 1], [120.635477, 31.277872, 1], [120.61018, 31.314886, 1], [120.744554, 31.375122, 1], [120.672626, 31.311643, 1], [120.740392, 31.270454, 1], [116.321404, 39.990632, 1], [120.737579, 31.268801, 1], [120.57905, 31.303864, 1], [120.677865, 31.322518, 1], [120.830034, 31.321659, 1], [120.675773, 31.301285, 1], [120.67316, 31.301914, 1], [120.751868, 31.276324, 1], [120.677751, 31.301185, 1], [120.782726, 31.312978, 1], [116.321404, 39.990632, 1], [120.743618, 31.270089, 1], [120.740392, 31.270454, 1], [120.730353, 31.271073, 1], [120.681294, 31.321418, 1], [120.730353, 31.271073, 1], [120.736056, 31.264702, 1], [120.740392, 31.270454, 1], [120.721372, 31.372743, 1], [120.751868, 31.276324, 1], [120.674831, 31.32159, 1], [120.658435, 31.143837, 1], [120.67427, 31.327368, 1], [121.40008, 31.230058, 1], [120.746911, 31.28105, 1], [120.743858, 31.263709, 1], [120.427795, 31.332868, 1], [120.728959, 31.283179, 1], [120.751868, 31.276324, 1], [120.782418, 31.313036, 1], [120.830034, 31.321659, 1], [120.740392, 31.270454, 1], [120.744554, 31.375122, 1], [120.736056, 31.264702, 1], [120.674831, 31.32159, 1], [120.611878, 31.342606, 1], [120.830034, 31.321659, 1], [120.740392, 31.270454, 1], [120.736056, 31.264702, 1], [121.40008, 31.230058, 1], [120.737579, 31.268801, 1], [120.726114, 31.328894, 1], [120.736056, 31.264702, 1], [120.427795, 31.332868, 1], [120.427795, 31.332868, 1], [120.625009, 31.298903, 1], [120.728959, 31.283179, 1], [120.673487, 31.30151, 1], [120.674831, 31.32159, 1], [120.744683, 31.271266, 1], [120.42135, 31.339427, 1], [120.609745, 31.314673, 1], [120.743364, 31.259515, 1], [120.617087, 31.295636, 1], [120.736056, 31.264702, 1], [120.673912, 31.28294, 1], [120.673912, 31.28294, 1], [120.662691, 31.374124, 1], [120.675773, 31.301285, 1], [120.677907, 31.322893, 1], [120.73701, 31.268359, 1], [120.654771, 31.325817, 1], [120.644891, 31.36923, 1], [120.67342, 31.134537, 1], [120.740392, 31.270454, 1], [120.721372, 31.372743, 1], [120.736056, 31.264702, 1], [120.587539, 31.294884, 1], [120.644891, 31.36923, 1], [120.644891, 31.36923, 1], [120.675773, 31.301285, 1], [120.66268, 31.295012, 1], [120.531206, 31.299944, 1], [120.737579, 31.268801, 1], [120.726406, 31.328809, 1], [120.446046, 31.327838, 1], [120.740819, 31.259654, 1], [120.740392, 31.270454, 1], [120.782418, 31.313036, 1], [120.719558, 31.367303, 1], [120.589316, 31.308822, 1], [120.627095, 31.239935, 1], [120.830034, 31.321659, 1], [120.736099, 31.268243, 1], [120.589613, 31.304566, 1], [120.736099, 31.268243, 1], [120.830034, 31.321659, 1], [120.743996, 31.2632, 1], [120.621279, 31.260658, 1], [120.635207, 31.223473, 1], [120.67316, 31.301914, 1], [120.746911, 31.28105, 1], [120.678296, 31.301247, 1], [120.740392, 31.270454, 1], [120.572797, 31.324349, 1], [120.73022, 31.268655, 1], [120.673487, 31.30151, 1], [120.561285, 31.278847, 1], [120.658435, 31.143837, 1], [120.751868, 31.276324, 1]], "<5K": [[120.674054, 31.244839, 1], [120.782726, 31.312978, 1], [120.534879, 31.288799, 1], [120.534879, 31.288799, 1], [120.606557, 31.315347, 1], [120.694614, 31.440453, 1], [120.677751, 31.301185, 1], [120.545792, 31.282443, 1], [121.136347, 31.464802, 1], [120.660232, 31.270876, 1], [120.694614, 31.440453, 1], [120.545678, 31.283175, 1], [120.606557, 31.315347, 1], [120.606204, 31.31531, 1], [120.606204, 31.31531, 1], [120.675773, 31.301285, 1], [120.635207, 31.223473, 1], [120.743858, 31.263709, 1], [120.606557, 31.315347, 1], [120.614625, 31.367224, 1], [120.740753, 31.259364, 1], [120.673487, 31.30151, 1], [120.606557, 31.315347, 1], [120.606557, 31.315347, 1], [120.606557, 31.315347, 1], [120.762171, 31.256994, 1], [120.629446, 31.273207, 1], [120.736056, 31.264702, 1], [120.633279, 30.890044, 1], [120.698702, 31.43863, 1], [120.740392, 31.270454, 1], [120.677751, 31.301185, 1], [120.606557, 31.315347, 1], [120.729188, 31.266647, 1], [120.736056, 31.264702, 1], [120.635207, 31.223473, 1], [120.606557, 31.315347, 1], [120.66268, 31.295012, 1], [120.756485, 31.630369, 1], [120.737579, 31.268801, 1], [120.760112, 31.267734, 1], [120.728959, 31.283179, 1], [120.655944, 31.321389, 1], [120.744082, 31.272092, 1], [120.744555, 31.282666, 1]], "5-8K": [[120.729188, 31.266647, 1], [120.67316, 31.301914, 1], [120.740392, 31.270454, 1], [120.730636, 31.268613, 1], [120.67764, 31.324092, 1], [120.744683, 31.271266, 1], [120.6377, 31.151546, 1], [120.425087, 31.340143, 1], [120.740753, 31.259364, 1], [120.681934, 31.321388, 1], [120.800857, 31.323972, 1], [120.713688, 31.329436, 1], [120.644891, 31.36923, 1], [120.606557, 31.315347, 1], [120.745862, 31.26532, 1], [120.694902, 31.439597, 1], [120.740392, 31.270454, 1], [120.517484, 31.239027, 1], [120.808916, 31.632538, 1], [120.567061, 31.264605, 1], [120.782418, 31.313036, 1], [120.808916, 31.632538, 1], [120.808916, 31.632538, 1], [120.781566, 31.295818, 1], [120.748793, 31.281395, 1], [120.67316, 31.301914, 1], [120.734803, 31.283551, 1], [120.536036, 31.914382, 1], [120.736197, 31.281421, 1], [120.620934, 31.256077, 1], [120.487595, 31.351456, 1], [120.729188, 31.266647, 1], [120.606557, 31.315347, 1], [120.606557, 31.315347, 1], [120.67316, 31.301914, 1], [120.736846, 31.366434, 1], [120.67316, 31.301914, 1], [120.751868, 31.276324, 1], [120.751868, 31.276324, 1], [120.743901, 31.271042, 1], [120.728719, 31.273888, 1], [120.737579, 31.268801, 1], [120.729188, 31.266647, 1], [120.610808, 31.336365, 1], [120.695298, 31.183873, 1], [120.74486, 31.273131, 1], [120.73022, 31.268655, 1], [120.740392, 31.270454, 1], [120.607269, 31.311305, 1], [120.606557, 31.315347, 1], [120.606557, 31.315347, 1], [120.789811, 31.31306, 1], [120.545678, 31.283175, 1], [120.830034, 31.321659, 1], [120.729188, 31.266647, 1], [120.751868, 31.276324, 1], [120.656422, 31.319628, 1], [120.675773, 31.301285, 1], [120.668687, 31.296417, 1], [120.675773, 31.301285, 1], [120.606557, 31.315347, 1], [120.736745, 31.269358, 1], [120.610946, 31.312888, 1], [121.057547, 31.288666, 1], [120.737046, 31.260708, 1], [120.545678, 31.283175, 1], [120.545678, 31.283175, 1], [120.606557, 31.315347, 1], [120.606557, 31.315347, 1], [120.606557, 31.315347, 1], [120.606557, 31.315347, 1], [120.606557, 31.315347, 1], [120.606557, 31.315347, 1], [120.626152, 31.468818, 1], [120.740392, 31.270454, 1], [120.606204, 31.31531, 1], [120.606204, 31.31531, 1], [120.610946, 31.312888, 1], [120.736745, 31.269358, 1], [120.75086, 31.28002, 1], [120.566273, 31.29219, 1], [120.729188, 31.266647, 1], [120.531262, 31.289926, 1], [120.606557, 31.315347, 1], [120.745472, 31.272965, 1], [120.7399, 31.258616, 1], [120.671263, 31.302574, 1], [120.607641, 31.317162, 1], [120.607641, 31.317162, 1], [120.606204, 31.31531, 1], [120.744248, 31.272594, 1], [120.737579, 31.268801, 1], [120.74299, 31.27153, 1], [120.972151, 31.363999, 1], [120.67316, 31.301914, 1], [120.830034, 31.321659, 1], [120.534879, 31.288799, 1], [120.621454, 31.34194, 1], [120.740665, 31.262588, 1], [120.534879, 31.288799, 1], [120.713688, 31.329436, 1], [120.7415, 31.246744, 1], [120.75157, 31.377438, 1], [120.830034, 31.321659, 1], [120.740392, 31.270454, 1], [120.606204, 31.31531, 1], [120.606204, 31.31531, 1], [120.606204, 31.31531, 1], [120.606204, 31.31531, 1], [120.607641, 31.317162, 1], [120.607641, 31.317162, 1], [120.607641, 31.317162, 1], [120.607641, 31.317162, 1], [120.607641, 31.317162, 1], [120.607641, 31.317162, 1], [120.606204, 31.31531, 1], [120.538038, 30.843459, 1], [121.137569, 31.450498, 1], [120.576908, 31.876025, 1], [120.606557, 31.315347, 1], [120.606557, 31.315347, 1], [120.606557, 31.315347, 1], [120.606557, 31.315347, 1], [120.606557, 31.315347, 1], [120.638208, 31.276765, 1], [120.606557, 31.315347, 1], [120.606557, 31.315347, 1], [120.606557, 31.315347, 1], [120.606557, 31.315347, 1], [120.662691, 31.374124, 1], [120.606204, 31.31531, 1], [120.606204, 31.31531, 1], [120.606204, 31.31531, 1], [120.606204, 31.31531, 1], [120.606204, 31.31531, 1], [120.606204, 31.31531, 1], [120.606204, 31.31531, 1], [120.54009, 31.291386, 1], [120.606557, 31.315347, 1], [120.740392, 31.270454, 1], [120.977913, 31.335967, 1], [120.73701, 31.268359, 1], [120.736745, 31.269358, 1], [120.615791, 31.248828, 1], [120.606204, 31.31531, 1], [120.606557, 31.315347, 1], [120.561285, 31.278847, 1], [120.760112, 31.267734, 1], [120.737579, 31.268801, 1], [120.635207, 31.223473, 1], [120.745862, 31.26532, 1], [120.743618, 31.270089, 1], [120.80656, 31.309083, 1], [120.67316, 31.301914, 1], [120.67316, 31.301914, 1], [120.545678, 31.283175, 1], [120.675773, 31.301285, 1], [120.745715, 31.270792, 1], [120.752133, 31.275931, 1], [120.740392, 31.270454, 1], [120.736056, 31.264702, 1], [120.740906, 31.259732, 1], [120.545792, 31.282443, 1], [120.534879, 31.288799, 1], [120.635727, 31.262326, 1], [120.53337, 31.284317, 1], [120.606557, 31.315347, 1], [120.606557, 31.315347, 1], [120.730436, 31.268363, 1], [120.545792, 31.282443, 1], [120.453916, 31.920597, 1], [120.751868, 31.276324, 1], [120.606204, 31.31531, 1], [120.586237, 31.335448, 1], [120.677751, 31.301185, 1], [120.427795, 31.332868, 1], [120.740392, 31.270454, 1], [120.543933, 31.276319, 1], [120.428409, 31.331202, 1], [120.694857, 31.439988, 1], [120.662691, 31.374124, 1], [120.662691, 31.374124, 1], [120.73022, 31.268655, 1], [120.63495, 31.380095, 1], [120.606204, 31.31531, 1], [120.735843, 31.281725, 1], [120.878254, 31.276029, 1], [120.534895, 31.28867, 1], [120.621279, 31.260658, 1], [120.606204, 31.31531, 1], [120.672626, 31.311643, 1], [120.677232, 31.167348, 1], [120.738059, 31.260279, 1], [120.640852, 31.299443, 1], [120.730636, 31.268613, 1], [120.737579, 31.268801, 1], [120.736056, 31.264702, 1], [120.736434, 31.264806, 1], [120.638243, 31.307893, 1], [120.740392, 31.270454, 1], [120.745715, 31.270792, 1], [120.772016, 31.278514, 1], [120.768615, 31.815309, 1], [120.545678, 31.283175, 1], [120.736056, 31.264702, 1], [120.73022, 31.268655, 1], [120.619266, 31.32107, 1], [120.740392, 31.270454, 1], [120.545678, 31.283175, 1], [120.775625, 31.646517, 1], [120.543939, 31.27632, 1], [120.830034, 31.321659, 1], [120.621667, 31.344689, 1], [120.67142, 31.31169, 1], [120.534879, 31.288799, 1], [120.65976, 31.132204, 1], [120.589613, 31.304566, 1], [120.589613, 31.304566, 1], [120.706951, 31.437298, 1], [120.51642, 31.38564, 1], [120.70056, 31.538333, 1], [120.740867, 31.283509, 1], [120.729432, 31.362964, 1], [120.635207, 31.223473, 1], [120.974232, 31.368639, 1], [120.597273, 31.303629, 1], [120.786061, 31.346362, 1], [120.742956, 31.272322, 1], [120.736745, 31.269358, 1]], "面议": [[120.737579, 31.268801, 1], [120.740392, 31.270454, 1], [120.740392, 31.270454, 1], [120.545736, 31.283166, 1], [120.545678, 31.283175, 1], [120.623744, 31.346115, 1], [120.750746, 31.276686, 1], [120.680966, 31.323305, 1], [120.589613, 31.304566, 1], [120.679209, 31.322043, 1], [120.743858, 31.263709, 1], [120.739907, 31.25896, 1], [120.830034, 31.321659, 1], [120.589613, 31.304566, 1], [120.680042, 31.312837, 1], [120.60782, 31.285186, 1], [120.740392, 31.270454, 1], [120.458407, 31.280663, 1], [121.060104, 31.391407, 1], [120.651628, 31.317261, 1], [120.744531, 31.282148, 1], [120.57905, 31.303864, 1], [120.674831, 31.32159, 1], [120.635207, 31.223473, 1], [120.630229, 31.325516, 1], [120.740819, 31.259654, 1], [120.762173, 31.691416, 1], [120.736745, 31.269358, 1], [120.740392, 31.270454, 1], [120.739624, 31.271157, 1], [120.531206, 31.299944, 1]], ">20K": [[120.751868, 31.276324, 1], [120.751868, 31.276324, 1], [121.128619, 31.296403, 1], [120.740392, 31.270454, 1], [120.740392, 31.270454, 1], [120.74092, 31.260035, 1], [120.681934, 31.321388, 1], [120.728959, 31.283179, 1]], "15-20K": [[121.128619, 31.296403, 1], [120.740392, 31.270454, 1], [120.427795, 31.332868, 1], [120.673912, 31.28294, 1], [120.740392, 31.270454, 1], [120.746368, 31.270891, 1], [120.672626, 31.311643, 1], [120.606557, 31.315347, 1], [120.751868, 31.276324, 1], [120.997444, 31.166291, 1], [120.606557, 31.315347, 1], [120.740819, 31.259654, 1], [120.628268, 31.259262, 1], [120.446485, 31.965401, 1], [120.446485, 31.965401, 1], [120.673487, 31.30151, 1], [120.57593, 31.301877, 1], [120.782726, 31.312978, 1], [120.736316, 31.277789, 1], [120.672626, 31.311643, 1]]
            }
            var series=labels.map((i, j)=> {
                var name=i;
                var data=points[name];
                var color=colorList[j];
                return {
                    name: name, type: 'effectScatter', coordinateSystem: 'bmap', data: data, showEffectOn: 'render', rippleEffect: {
                        brushType: 'stroke'
                    }
                    , itemStyle: {
                        normal: {
                            color: color
                        }
                    }
                }
            }
            ) 
            console.log(series)
             var option= {
                bmap: {
                    center: [120.631007,
                    31.308762],
                    zoom: 12,
                    roam: true,
                    enableMapClick: false,
                    mapStyle: {
                        styleJson: [ {
                            "featureType": "all",
                            "elementType": "all",
                            "stylers": {
                                "lightness": 47, "saturation": -100
                            }
                        }
                        ,
                        {
                            "featureType": "highway",
                            "elementType": "geometry.fill",
                            "stylers": {
                                "color": "#ffffff"
                            }
                        }
                        ,
                        {
                            "featureType": "poi",
                            "elementType": "labels.icon",
                            "stylers": {
                                "visibility": "off"
                            }
                        }
                        ,
                        {
                            "featureType": "road",
                            "elementType": "labels",
                            "stylers": {
                                "visibility": "off"
                            }
                        }
                        ]
                    }
                }
                ,
                title: {
                    text: "测试海量点",
                    subtext: "测试海量点",
                    left: 'center',
                    top: 5,
                    backgroundColor: "rgba(255,255,255,0.8)",
                    textStyle: {
                        color: "#2B98DC", fontWeight: "bold"
                    }
                }
                ,
                legend: {
                    orient: 'vertical',
                    bottom: '200px',
                    left:"10",
                    backgroundColor:"rgba(255,255,255,0.8)",
                    data: labels.reverse(),
                    formatter: function (name) {
                        return '薪资 ' + name;
                    }
                }
                ,
                series: series
            }
            myChart.setOption(option);
            setTimeout(init, 0) 
            function init() {
                initMap();
            }
            function getMap() {
                return myChart.getModel().getComponent('bmap').getBMap();
            }
            function initMap() {
                var top_left_navigation=new BMap.NavigationControl( {
                    type: BMAP_NAVIGATION_CONTROL_SMALL
                }
                );
                var map=getMap();
                //map.centerAndZoom("苏州", 13);
                map.addControl(top_left_navigation);
                map.disableDoubleClickZoom();
                return map;
            }
        }
    }
    ,
    components: {
        MyDialog,
        Tree
    }
}

</script> 
<style scoped>
.dialog h1:nth-child(1)
{
    font-size: 30px;
}
.dialog h1:nth-child(2)
{
    font-size: 20px;
    text-align: center;
}
.dialog>p{
    border-bottom: 1px solid rgb(169,169,169);
    margin:20px 0px; 
}
.dialog p span{
    color: black;
    font-size:15px;
}
.dialog button{
    float: right;
    font-size: 18px;
}
 .map {
    position: fixed;
    top: 60px;
    bottom: 0px;
    left:0px;
    right: 0px;
}

.map-left {
    position: absolute;
    width: 200px;
    background-color: rgb(232, 235, 237);
    top:0px;
    bottom: 0px;
    overflow: scroll;
   }
.map-left-table,
.map-left-layer {
    padding: 8px 16px;
    height: 50px;
}

.map-left-field {
    padding: 8px 16px;
}
.select-item {
  background-color: rgb(81,130,228);
  text-align: center;
  border-radius: 3px;
  cursor:pointer;
  padding: 0px 20px;
  margin:5px 5px;
  color: #fff;
  display: inline-block;
  width: 80px;
  height: 30px;
  line-height: 30px;
}
.map-left-table p,
.map-left-layer p {
    color: black;
    margin: 10px 0;
}

.map-left-field ul li {
    color: black;
    margin: 10px 20px;
    /*list-style: square;*/
}

.map-content {
    position: absolute;
    top: 0px;
    left: 200px;
    right: 220px;
    bottom: 0px;
    background-color: #F3F5F6;
}

.map-content-condition {
    padding: 8px 16px;
}
.map-content-condition{
    position: relative;
}
.drag-name{
    width: 50px;
    height: 40px;
    line-height: 40px;
    text-align: center;
    font-size: 20px;
}
.drag-div{
    position: absolute;
    top: 8px;
    left: 70px;
    height: 40px;
    line-height: 40px;
    right: 0px;
    bottom: 0px;
}
.drag-div2{
    position: absolute;
    top: 64px;
    left: 70px;
    height: 40px;
    line-height: 40px;
    right: 0px;
    bottom: 0px;
}
.select-project-item{
    display: inline;
}


.map-content-down {
    height: 100%;
    width: 100%;
}

.map-content-sort {
    width: 120px;
    border-right: 1px solid rgb(154, 154, 154);
    padding: 8px 16px;
    height: 100%;
    float: left;
}

#map {
    /*float: left;*/
    height: 100%;
    width: auto;
    margin-left: 130px;
}

.map-right {
    position: absolute;
    top: 0px;
    width: 220px;
    bottom: 0px;
    right: 0px;
    background-color: #E8EBED;
}

.map-title {
    padding: 8px 16px;
    height: 80px;
}
.map-title input {
    margin: 10px 0px;
}
.map-type {
    height: 160px;
    padding: 8px 16px;
    position: absolute;
    top: 80px;
}
.map-type div {
    cursor: pointer;
    width: 40px;
    height: 40px;
    display: flex;
    justify-content: center;
    align-items: center;
    background-color: #fff;
}

.div1 {
    position: absolute;
    top: 40px;
    left: 20px;
}

.div2 {
    position: absolute;
    top: 40px;
    left: 90px;
}

.div3 {
    position: absolute;
    top: 40px;
    left: 150px;
}

.div4 {
    position: absolute;
    top: 100px;
    left: 20px;
}

.div5 {
    position: absolute;
    top: 100px;
    left: 90px;
}

.div6 {
    position: absolute;
    top: 100px;
    left: 150px;
}

.map-type-selected {
    border: 1px solid #5182e4;
    ;
}
.map-option{
    position: absolute;
    top: 250px;
    bottom: 0px;
    left: 0px;
    right: 0px;
}

</style>
